Repository: jfbercher/quiz_editor
Catalog: locales/*/LC_MESSAGES/quiz_editor.po
Languages: es

source: Global Score
es: Puntuación global

source: Answer:
es: Respuesta:

source: Attempts:
es: Intentos:

source: Submit
es: Enviar

source: Correction
es: Corrección

source: NAME (UPPERCASE)
es: APELLIDO (MAYÚSCULAS)

source: First name
es: Nombre

source: Confirm identity
es: Confirmar identidad

source: Input in progress...
es: Entrada en curso...

source: Please enter your first name and LAST NAME here.
es: Introduzca aquí su nombre y sus APELLIDOS.

source: Student identified as
es: Estudiante identificado como

source: Modified input
es: Entrada modificada

source: ❌ Error sending data
es: ❌ Error al enviar los datos

source: ✅ Recorded at
es: ✅ Registrado a las

source: Send in progress...
es: Envío en curso...

source: Please enter your first name and LAST NAME before continuing.
es: Introduzca su nombre y apellidos antes de continuar.

source: Unknown
es: Desconocido

source: Feedback recorded at
es: Comentario registrado a las

source: New Quiz
es: Nuevo cuestionario

source: ⚠️ Unclosed brace
es: ⚠️ Llave sin cerrar

source: Render preview ({label}) :</div>
es: Renderizar vista previa ({label}) :</div>

source: The file name cannot be empty.
es: El nombre del archivo no puede estar vacío.

source: File saved successfully as `{filename}`
es: Archivo guardado correctamente como `{filename}`

source: Enter a title here
es: Introduzca aquí un título

source: None
es: Ninguno

source: YAML Editor - {FILE_PATH}
es: Editor YAML - {FILE_PATH}

source: Document Title
es: Título del documento

source: ⚠️ File encrypted with password. Be sure to use the `mandatoryInternet=True` option when initializing the quiz
es: ⚠️ Archivo cifrado con contraseña. Asegúrate de utilizar la opción `mandatoryInternet=True` al inicializar el cuestionario

source: Configure & Export
es: Configurar y exportar

source: my_quiz
es: mi_cuestionario

source: File name (without extension)
es: Nombre del archivo (sin extensión)

source: Reindex question labels
es: Reindexar etiquetas de preguntas

source: Reindex to ensure continuity of labels, e.g.: quiz1, quiz2, etc.
es: Reindexar para garantizar la continuidad de las etiquetas, por ejemplo: quiz1, quiz2, etc.

source: Untitled
es: Sin título

source: Extract (YAML)
es: Extraer (YAML)

source: Encrypted YAML
es: YAML cifrado

source: Encoded YAML
es: YAML codificado

source: Unencoded YAML
es: YAML sin codificar

source: Password
es: Contraseña

source: 💡 This pwd participates in encryption
es: 💡 Esta contraseña participa en el cifrado

source: 💡 This mode allows you to save all or part of the questions in a new file,
es: 💡 Este modo le permite guardar todas o parte de las preguntas en un nuevo archivo,

source: with optional encryption.
es: con cifrado opcional.

source: Interactive (self-assessment)
es: Interactivo (autoevaluación)

source: 💡 This mode allows immediate self-correction for students.
es: 💡 Este modo permite a los estudiantes autocorregirse de forma inmediata.

source: Exam (Server)
es: Examen (Servidor)

source: Receiving server URL
es: URL del servidor de recepción

source: Please enter the server URL to continue.
es: Introduzca la URL del servidor para continuar.

source: Negative points (-1 malus)
es: Puntos negativos (-1 malus)

source: 💡 Extraction in LaTeX-AMC format.
es: 💡 Extracción en formato LaTeX-AMC.

source: ⬇️ Download {file_name}{extension}
es: ⬇️ Descargar {file_name}{extension}

source: ⬇️ Download {file_name}{mode}{extension}
es: ⬇️ Descargar {file_name}{mode}{extension}

source: ⬇️ Download {file_name}_qo{mode}{extension} (questions only)
es: ⬇️ Descargar {file_name}_qo{mode}{extension} (solo preguntas)

source: 📂 Browse
es: 📂 Examinar

source: 📥 Import new file
es: 📥 Importar nuevo archivo

source: Choose file
es: Elegir archivo

source: Loads the contents of a YAML file into the editor
es: Carga el contenido de un archivo YAML en el editor

source: 📖 Enter a title here
es: 📖 Introduzca aquí un título

source: File `{file_name}` loaded successfully!
es: ¡Archivo `{file_name}` cargado correctamente!

source: Read Error:
es: Error de lectura:

source: 🎰🎲♠ Quiz management
es: 🎰🎲♠ Gestión de cuestionarios

source: All ({len_all})
es: Todos ({len_all})

source: Category
es: Categoría

source: Filter by Tags
es: Filtrar por etiquetas

source: Choose a tag
es: Elige una etiqueta

source: Choose a question from {lenf}
es: Elige una pregunta de {lenf}

source: 👯 Duplicate
es: 👯 Duplicar

source: 🗑️ Delete
es: 🗑️ Eliminar

source: ❗ Confirm?
es: ❗ ¿Confirmar?

source: Last quiz!
es: ¡Último cuestionario!

source: Cancel
es: Cancelar

source: ➕ New Quiz
es: ➕ Nuevo cuestionario

source: Select quiz type
es: Seleccionar tipo de cuestionario

source: Defines the validation behavior of the quiz.
es: Define el comportamiento de validación del cuestionario.

source: Create
es: Crear

source: New question
es: Nueva pregunta

source: Choice 1
es: Opción 1

source: 📤 Export
es: 📤 Exportar

source: ✅ Select all
es: ✅ Seleccionar todo

source: ❌ Deselect all
es: ❌ Deseleccionar todo

source: Select questions
es: Seleccionar preguntas

source: **{lsq} question(s) selected**
es: **{lsq} pregunta(s) seleccionada(s)**

source: Choose export format
es: Elija el formato de exportación

source: Check questions to export.
es: Marque las preguntas que desea exportar.

source: The main title of the YAML file (key ‘title’) - Editable here.
es: El título principal del archivo YAML (clave «title»): se puede editar aquí.

source: Current file: `{shared_fn}`
es: Archivo actual: `{shared_fn}`

source: Edit to ‘Save As’.
es: Editar para “Guardar como”.

source: ‘Save As’.
es: ‘Guardar como’.

source: 💾 Save
es: 💾 Guardar

source: YAML cleaned and saved ✔️
es: YAML limpiado y guardado ✔️

source: Download!
es: ¡Descargar!

source: Only AFTER saving the YAML
es: Solo DESPUÉS de guardar el YAML

source: Editing {current_quiz}
es: Editando {current_quiz}

source: Export
es: Exportar

source: Check to include this question in future YAML exports
es: Marque para incluir esta pregunta en futuras exportaciones YAML

source: ➕ New category...
es: ➕ Nueva categoría...

source: 🗂️ Category
es: 🗂️ Categoría

source: Question category
es: Categoría de la pregunta

source: Name of the new category
es: Nombre de la nueva categoría

source: Enter the name here...
es: Introduzca el nombre aquí...

source: Type to add the categor
es: Escriba para añadir la categoría

source: 🏷️ Tags (Difficulty, Sub-theme...)
es: 🏷️ Etiquetas (Dificultad, Subtema...)

source: Choose or enter a new tag
es: Elige o introduce una nueva etiqueta

source: Question text
es: Texto de la pregunta

source: Supports Markdown and LaTeX (e.g., $x^2$).
es: Compatible con Markdown y LaTeX (por ejemplo, $x^2$).

source: Label
es: Etiqueta

source: Question label.
es: Etiqueta de la pregunta.

source: Template variables
es: Variables de plantilla

source: In the case of templates, define the *names* of variables, and define how to generate values for html or $\LaTeX$-AMC exports. - size is ajustable, - default values are generated corresponding to type and size, but these can be edited. In particular, all distributions from [numpy Generator](https://numpy.org/doc/stable/reference/random/generator.html) can be used.
es: En el caso de las plantillas, defina los *nombres* de las variables y defina cómo generar valores para exportaciones html o $\LaTeX$-AMC. - el tamaño es ajustable, - los valores predeterminados se generan según el tipo y el tamaño, pero se pueden editar. En particular, se pueden usar todas las distribuciones del [Generador numpy](https://numpy.org/doc/stable/reference/random/generator.html).

source: ➕ Add variable
es: ➕ Añadir variable

source: '{name}' is not a valid Python identifier
es: '{name}' no es un identificador de Python válido

source: 🔗 Logical constraints (XOR, IMPLY...)
es: 🔗 Restricciones lógicas (XOR, IMPLY...)

source: Remove this constraint
es: Eliminar esta restricción

source: ➕ Add constraint
es: ➕ Añadir restricción

source: Propositions
es: Proposiciones

source: Short identifier for the proposition.
es: Identificador breve de la proposición.

source: Correct?
es: ¿Correcto?

source: Expected value
es: Valor esperado

source: Text
es: Texto

source: Proposition
es: Proposición

source: Explanation (answer)
es: Explicación (respuesta)

source: Message displayed after validation.
es: Mensaje que se muestra tras la validación.

source: Hint (tip)
es: Pista (consejo)

source: Optional hint.
es: Pista opcional.

source: Bonus
es: Bonificación

source: Points added (default = 1).
es: Puntos añadidos (por defecto = 1).

source: Penalty
es: Penalización

source: Points deducted (default = 0).
es: Puntos restados (por defecto = 0).

source: Tolerance %
es: Tolerancia %

source: Tolerance in % (default = 0).
es: Tolerancia en % (por defecto = 0).

source: Tolerance Abs
es: Tolerancia Abs

source: Tolerance in absolute value (default = 0.01).
es: Tolerancia en valor absoluto (por defecto = 0,01).

source: copy
es: copiar

source: ➕ Add a proposal
es: ➕ Añadir una propuesta

source: Use the sidebar to navigate or create a new quiz.
es: Utilice la barra lateral para navegar o crear un nuevo cuestionario.
