Repository: jfbercher/quiz_editor
Catalog: src/quiz_editor/locales/*/LC_MESSAGES/quiz_editor.po
Languages: de, fr, it

source: Global Score
de: Gesamtpunktzahl
fr: Score global
it: Punteggio Globale

source: Answer:
de: Antwort:
fr: Réponse
it: Risposta:

source: Attempts:
de: Versuche:
fr: Tentatives
it: Tentativi:

source: Submit
de: Absenden
fr: Soumettre
it: Invia

source: NAME (UPPERCASE)
de: NAME (GROSSBUCHSTABEN)
fr: NOM (MAJUSCULES)
it: COGNOME (MAIUSCOLO)

source: First name
de: Vorname
fr: Prénom
it: Nome

source: Confirm identity
de: Identität bestätigen
fr: Confirmation de l'identité
it: Conferma identità

source: Input in progress...
de: Eingabe läuft...
fr: Saisie en cours
it: Inserimento in corso...

source: Please enter your first name and LAST NAME here.
de: Geben Sie hier Ihren Vornamen und NACHNAMEN ein.
fr: Entrez vos prénom en NOM ici
it: Inserisci qui il tuo nome e il tuo COGNOME.

source: Student identified as
de: Student identifiziert als
fr: Étudiant identifié :
it: Studente identificato come

source: Modified input
de: Eingabe geändert
fr: Entrée modifiée
it: Inserimento modificato

source: ❌ Error sending data
de: ❌ Fehler beim Senden der Daten
fr: ❌ Erreur de transmission des données
it: ❌ Errore nell'invio dei dati

source: ✅ Recorded at
de: ✅ Registriert am
fr: ✅ Enregistrer à
it: ✅ Registrato alle

source: Send in progress...
de: Übertragung läuft...
fr: Transmission en cours...
it: Invio in corso...

source: Please enter your first name and LAST NAME before continuing.
de: Bitte geben Sie Vor- und Nachnamen ein, bevor Sie fortfahren.
fr: Entrez vos prénom et NOM avant de pouvoir poursuivre
it: Inserisci nome e COGNOME prima di continuare.

source: Unknown
de: Unbekannt
fr: Inconnu
it: Sconosciuto

source: Feedback recorded at
de: Rückmeldung registriert am
fr: Feedback enregistré à
it: Feedback registrato alle

source: New Quiz
de: Neues Quiz
fr: Nouveau Quiz
it: Nuovo Quiz

source: ⚠️ Unclosed brace
de: ⚠️ Nicht geschlossene Klammer
fr: ⚠️ Accolade non fermée
it: ⚠️ Parentesi graffa non chiusa

source: Render preview ({label}) :</div>
de: Vorschau anzeigen ({label}) :</div>
fr: Aperçu du rendu ({label}) :</div>
it: Anteprima della resa ({label}) :</div>

source: The file name cannot be empty.
de: Der Dateiname darf nicht leer sein.
fr: Le nom du fichier ne peut pas être vide.
it: Il nome del file non può essere vuoto.

source: File saved successfully as `{filename}`
de: Datei erfolgreich als `{filename}` gespeichert
fr: Fichier enregistré proprement sous `{filename}`
it: File salvato con successo come `{filename}`

source: Enter a title here
de: Geben Sie hier einen Titel ein
fr: Entrez un titre ici
it: Inserisci un titolo qui

source: None
de: Keine
fr: Aucune
it: Nessuna

source: YAML Editor - {FILE_PATH}
fr: Éditeur YAML - {FILE_PATH}
it: Editor YAML - {FILE_PATH}

source: Document Title
de: Dokumenttitel
fr: Titre du document
it: Titolo del documento

source: ⚠️ File encrypted with password. Be sure to use the `mandatoryInternet=True` option when initializing the quiz
de: ⚠️ Datei mit Passwort verschlüsselt. Stellen Sie sicher, dass Sie beim Initialisieren des Quiz die Option `mandatoryInternet=True` verwenden
fr: ⚠️ Fichier encrypté avec mot de passe. Assurez vous d'utiliser l'option `mandatoryInternet=True` à l'initiatlisation du quiz
it: ⚠️ File crittografato con password. Assicurati di usare l'opzione `mandatoryInternet=True` all'inizializzazione del quiz

source: Configure & Export
de: Konfigurieren & Exportieren
fr: Configurer & Exporter
it: Configura ed Esporta

source: my_quiz
de: mein_quiz
fr: mon_quiz
it: mio_quiz

source: File name (without extension)
de: Dateiname (ohne Erweiterung)
fr: Nom du fichier (sans extension)
it: Nome del file (senza estensione)

source: Reindex question labels
de: Fragen-Labels neu indizieren
fr: Réindexer les labels de questions
it: Reindicizzare le etichette delle domande

source: Reindex to ensure continuity of labels, e.g.: quiz1, quiz2, etc.
de: Neu indizieren, um die Kontinuität der Labels zu gewährleisten, z. B.: quiz1, quiz2, etc.
fr: Réindexe pour assurer la continuité des labels, eg: quiz1, quiz2, etc
it: Reindicizza per garantire la continuità delle etichette, es: quiz1, quiz2, ecc.

source: Untitled
de: Unbenannt
fr: Sans titre
it: Senza titolo

source: Extract (YAML)
de: Auszug (YAML)
fr: Extrait (YAML)
it: Estratto (YAML)

source: Encrypted YAML
de: Verschlüsseltes YAML
fr: YAML crypté
it: YAML crittografato

source: Encoded YAML
de: Kodiertes YAML
fr: YAML encodé
it: YAML codificato

source: Unencoded YAML
de: Unkodiertes YAML
fr: YAML sans encodage
it: YAML senza codifica

source: Password
de: Passwort
fr: Mot de passe

source: 💡 This pwd participates in encryption
de: 💡 Dieses Passwort wird für die Verschlüsselung verwendet
fr: 💡 Ce pwd participe à l'encryption
it: 💡 Questa password partecipa alla crittografia

source: 💡 This mode allows you to save all or part of the questions in a new file,
de: 💡 In diesem Modus können Sie alle oder einen Teil der Fragen in einer neuen Datei speichern,
fr: 💡 Ce mode permet de sauvegarder tout ou partie des questions en un nouveau fichier,
it: 💡 Questa modalità consente di salvare tutte o parte delle domande in un nuovo file,

source: with optional encryption.
de: mit optionaler Verschlüsselung.
fr: avec encryptage optionnel.
it: con crittografia opzionale.

source: 💡 This mode allows immediate self-correction for students.
de: 💡 Dieser Modus ermöglicht den Schülern eine sofortige Selbstkorrektur.
fr: 💡 Ce mode permet l'autocorrection immédiate pour les élèves.
it: 💡 Questa modalità consente l'autocorrezione immediata per gli studenti.

source: Exam (Server)
de: Prüfung (Server)
fr: Examen (Serveur)
it: Esame (Server)

source: Receiving server URL
de: Empfangende Server-URL
fr: URL du serveur de réception
it: URL del server di ricezione

source: Please enter the server URL to continue.
de: Bitte geben Sie die Server-URL ein, um fortzufahren.
fr: Veuillez saisir l'URL du serveur pour continuer.
it: Inserire l'URL del server per continuare.

source: Negative points (-1 malus)
de: Minuspunkte (-1 Malus)
fr: Points négatifs (malus -1)
it: Punti negativi (malus -1)

source: 💡 Extraction in LaTeX-AMC format.
de: 💡 Export im LaTeX-AMC-Format.
fr: 💡 Extraction au format LaTeX-AMC.
it: 💡 Estrazione in formato LaTeX-AMC.

source: ⬇️ Download {file_name}{extension}
de: ⬇️ Herunterladen {file_name}{extension}
fr: ⬇️ Télécharger {file_name}{extension}
it: ⬇️ Scarica {file_name}{extension}

source: ⬇️ Download {file_name}{mode}{extension}
fr: ⬇️ Télécharger {file_name}{mode}{extension}

source: ⬇️ Download {file_name}_qo{mode}{extension} (questions only)
fr: ⬇️ Télécharger {file_name}_qo{mode}{extension} (questions only)

source: 📂 Browse
de: 📂 Durchsuchen
fr: 📂 Navigation
it: 📂 Sfoglia

source: 📥 Import new file
de: 📥 Neue Datei importieren
fr: 📥 Importer un nouveau fichier
it: 📥 Importa nuovo file

source: Choose file
de: Datei auswählen
fr: Choisir un fichier
it: Scegli un file

source: Loads the contents of a YAML file into the editor
de: Lädt den Inhalt einer YAML-Datei in den Editor
fr: Charge le contenu d'un fichier YAML dans l'éditeur
it: Carica i contenuti di un file YAML nell'editor

source: File `{file_name}` loaded successfully!
de: Datei `{file_name}` erfolgreich geladen!
fr: Fichier `{file_name}` chargé avec succès !
it: File `{file_name}` caricato con successo!

source: Read Error:
de: Lesefehler:
fr: Erreur de lecture :
it: Errore di lettura:

source: 🎰🎲♠ Quiz management
de: 🎰🎲♠ Quiz-Verwaltung
fr: 🎰🎲♠ Gestion des quizzes
it: 🎰🎲♠ Gestione dei quiz

source: All ({len_all})
de: Alle ({len_all})
fr: Toutes ({len_all})
it: Tutti ({len_all})

source: Category
de: Kategorie
fr: Catégorie
it: Categoria

source: Filter by Tags
de: Nach Tags filtern
fr: Filtrer par Tags
it: Filtra per Tag

source: Choose a tag
fr: Choisir un tag

source: Choose a question from {lenf}
de: Wählen Sie eine Frage aus {lenf}
fr: Choisir une question parmi {lenf}
it: Scegli una domanda tra {lenf}

source: 👯 Duplicate
de: 👯 Duplizieren
fr: 👯 Dupliquer
it: 👯 Duplica

source: 🗑️ Delete
de: 🗑️ Löschen
fr: 🗑️ Supprimer
it: 🗑️ Elimina

source: ❗ Confirm?
de: ❗ Bestätigen?
fr: ❗ Confirmer ?
it: ❗ Confermare?

source: Last quiz!
de: Letztes Quiz!
fr: Dernier quiz !
it: Ultimo quiz!

source: Cancel
de: Abbrechen
fr: Annuler
it: Annulla

source: ➕ New Quiz
de: ➕ Neues Quiz
fr: ➕ Nouveau Quiz
it: ➕ Nuovo Quiz

source: Defines the validation behavior of the quiz.
de: Legt das Validierungsverhalten des Quiz fest.
fr: Définit le comportement de validation du quiz.
it: Definisce il comportamento di validazione del quiz.

source: Create
de: Erstellen
fr: Créer
it: Crea

source: New question
de: Neue Frage
fr: Nouvelle question
it: Nuova domanda

source: Choice 1
de: Auswahl 1
fr: Choix 1
it: Scelta 1

source: 📤 Export
fr: 📤 Exportation
it: 📤 Esporta

source: ✅ Select all
de: ✅ Alle auswählen
fr: ✅ Tout cocher
it: ✅ Seleziona tutto

source: ❌ Deselect all
de: ❌ Alle abwählen
fr: ❌ Tout décocher
it: ❌ Deseleziona tutto

source: Select questions
fr: Sélectionner les questions

source: **{lsq} question(s) selected**
de: **{lsq} Frage(n) ausgewählt**
fr: **{lsq} question(s) sélectionnée(s)**
it: **{lsq} domanda(e) selezionata(e)**

source: Choose export format
de: Exportformat wählen
fr: Choisir le format d'export
it: Scegli il formato di esportazione

source: Check questions to export.
fr: Cochez des questions pour exporter.

source: The main title of the YAML file (key ‘title’) - Editable here.
de: Der Haupttitel der YAML-Datei (Schlüssel 'title') - Hier bearbeitbar.
fr: Le titre principal du fichier YAML (clé 'title') - Modifiable ici.
it: Il titolo principale del file YAML (chiave 'title') - Modificabile qui.

source: Current file: `{shared_fn}`
de: Aktuelle Datei: `{shared_fn}`
fr: Fichier en cours : `{shared_fn}`
it: File corrente: `{shared_fn}`

source: Edit to ‘Save As’.
de: Bearbeiten für 'Speichern unter'.
fr: Modifiez pour 'Enregistrer sous'.
it: Modifica per 'Salva come'.

source: ‘Save As’.
de: 'Speichern unter'.
fr: 'Enregistrer sous'.
it: 'Salva come'.

source: 💾 Save
de: 💾 Speichern
fr: 💾 Enregistrer
it: 💾 Salva

source: YAML cleaned and saved ✔️
de: YAML bereinigt und gespeichert ✔️
fr: YAML nettoyé et enregistré ✔️
it: YAML pulito e salvato ✔️

source: Download!
de: Herunterladen!
fr: Télécharger !
it: Scarica!

source: Only AFTER saving the YAML
de: Erst NACH dem Speichern der YAML
fr: Uniquement APRÈS avoir enregistré le YAML
it: Solo DOPO aver salvato lo YAML

source: Editing {current_quiz}
de: Bearbeite {current_quiz}
fr: Édition de {current_quiz}
it: Modifica di {current_quiz}

source: Export
fr: Exporter

source: Check to include this question in future YAML exports
de: Markieren, um diese Frage in zukünftige YAML-Exporte einzubeziehen
fr: Cocher pour inclure cette question dans le futur export YAML
it: Seleziona per includere questa domanda nelle future esportazioni YAML

source: ➕ New category...
de: ➕ Neue Kategorie...
fr: ➕ Nouvelle catégorie...
it: ➕ Nuova categoria...

source: 🗂️ Category
de: 🗂️ Kategorie
fr: 🗂️ Catégorie
it: 🗂️ Categoria

source: Question category
fr: Catégorie de la question

source: Name of the new category
de: Name der neuen Kategorie
fr: Nom de la nouvelle catégorie
it: Nome della nuova categoria

source: Enter the name here...
fr: Saisissez le nom ici...

source: Type to add the categor
de: Tippen, um die Kategorie hinzuzufügen
fr: Tapez pour ajouter la catégorie
it: Digita per aggiungere la categoria

source: 🏷️ Tags (Difficulty, Sub-theme...)
de: 🏷️ Tags (Schwierigkeit, Unterthema...)
fr: 🏷️ Tags (Difficulté, Thème secondaire...)
it: 🏷️ Tag (Difficoltà, Sotto-tema...)

source: Choose or enter a new tag
de: Tag wählen oder neuen Tag eingeben
fr: Choisir ou entrer un nouveau tag
it: Scegli o inserisci un nuovo tag

source: Question text
de: Fragetext
fr: Texte de la question
it: Testo della domanda

source: Question label.
fr: Label de la question.

source: Template variables
de: Template-Variablen
fr: Variables de la template
it: Variabili template

source: In the case of templates, define the *names* of variables, and define how to generate values for html or $\LaTeX$-AMC exports. - size is ajustable, - default values are generated corresponding to type and size, but these can be edited. In particular, all distributions from [numpy Generator](https://numpy.org/doc/stable/reference/random/generator.html) can be used.
de: Definieren Sie bei Templates die *Namen* der Variablen und legen Sie fest, wie Werte für HTML- oder $\LaTeX$-AMC-Exporte generiert werden. - Größe ist anpassbar, - Standardwerte werden entsprechend Typ und Größe generiert, können aber bearbeitet werden. Insbesondere können alle Verteilungen des [numpy Generators](https://numpy.org/doc/stable/reference/random/generator.html) verwendet werden.
fr: Dans le cas des templates, définit le *nom* des variables, et definit comment générer des valeurs pour les exports html et $\LaTeX$-AMC - la dimension `size` est ajustable, - les valeurs par défaut sont générées en fonction du type et de la dimension, mais ces défauts peuvent être édités. En particulier, toutes les distributions de [numpy Generator](https://numpy.org/doc/stable/reference/random/generator.html) peuvent être utilisées.
it: Nel caso dei template, definisci i *nomi* delle variabili e definisci come generare i valori per le esportazioni html o $\LaTeX$-AMC. - la dimensione è regolabile, - i valori predefiniti vengono generati in base al tipo e alla dimensione, ma possono essere modificati. In particolare, possono essere utilizzate tutte le distribuzioni da [numpy Generator](https://numpy.org/doc/stable/reference/random/generator.html).

source: '{name}' is not a valid Python identifier
de: '{name}' ist kein gültiger Python-Bezeichner
fr: '{name}'n'est pas un identifieur Python valide
it: '{name}' non è un identificatore Python valido

source: 🔗 Logical constraints (XOR, IMPLY...)
de: 🔗 Logische Bedingungen (XOR, IMPLY...)
fr: 🔗 Contraintes logiques (XOR, IMPLY...)
it: 🔗 Vincoli logici (XOR, IMPLY...)

source: Remove this constraint
de: Diese Bedingung entfernen
fr: Supprimer cette contrainte
it: Rimuovi questo vincolo

source: ➕ Add constraint
fr: ➕ Ajouter une contrainte

source: Short identifier for the proposition.
de: Kurze Kennung für den Vorschlag.
fr: Identifiant court de la proposition.
it: Identificatore breve per la proposizione.

source: Expected value
de: Erwarteter Wert
fr: Valeur attendue
it: Valore atteso

source: Text
fr: Texte
it: Testo

source: Explanation (answer)
de: Erklärung (Antwort)
fr: Explication (réponse)
it: Spiegazione (risposta)

source: Message displayed after validation.
de: Nachricht, die nach der Validierung angezeigt wird.
fr: Message affiché après la validation.
it: Messaggio visualizzato dopo la validazione.

source: Hint (tip)
de: Hinweis (Tipp)
fr: Indice (tip)
it: Suggerimento (tip)

source: Optional hint.
de: Optionaler Hinweis.
fr: Indice optionnel.
it: Suggerimento opzionale.

source: Points added (default = 1).
de: Zusatzpunkte (Standard = 1).
fr: Points ajoutés (défaut = 1).
it: Punti aggiunti (predefinito = 1).

source: Penalty
de: Abzug
fr: Malus
it: Penalità

source: Points deducted (default = 0).
de: Abzugspunkte (Standard = 0).
fr: Points retirés (défaut = 0).
it: Punti detratti (predefinito = 0).

source: Tolerance %
de: Toleranz %
fr: Tolérance %
it: Tolleranza %

source: Tolerance Abs
de: Toleranz Abs
fr: Tolérance Abs
it: Tolleranza Ass

source: copy
de: Kopie
fr: copie
it: copia

source: ➕ Add a proposal
de: ➕ Vorschlag hinzufügen
fr: ➕ Ajouter une proposition
it: ➕ Aggiungi una proposta

source: Use the sidebar to navigate or create a new quiz.
de: Nutzen Sie die Seitenleiste, um zu navigieren oder ein neues Quiz zu erstellen.
fr: Utilisez la barre latérale pour naviguer ou créer un nouveau quiz.
it: Usa la barra laterale per navigare o creare un nuovo quiz.

source: Interactive (self-assessment)
de: Interaktiv (Training)
it: Interattivo (Allenamento)

source: Select quiz type
de: Quiz-Typ auswählen
it: Seleziona tipo di quiz

source: Supports Markdown and LaTeX (e.g., $x^2$).
de: Unterstützt Markdown und LaTeX (z. B. $x^2$).
it: Supporta Markdown e LaTeX (es. $x^2$).

source: Label
it: Etichetta

source: Propositions
de: Vorschläge
it: Proposizioni

source: Correct?
de: Richtig?
it: Corretto?

source: Tolerance in % (default = 0).
de: Toleranz in % (Standard = 0).
it: Tolleranza in % (predefinito = 0).

source: Tolerance in absolute value (default = 0.01).
de: Toleranz als Absolutwert (Standard = 0,01).
it: Tolleranza in valore assoluto (predefinito = 0.01).
